isEvaluationRequest(AcDbAssocStatus)
Returns true for the AcDbAssocStatus values that are a request for an
AcDbAssocAction or AcDbAssocDependency to be evaluated, and false for
other AcDbAssocStatus values.
status:  The AcDbAssocStatus.
Returns:
Returns true iff the value of the AcDbAssocStatus indicates that an
AcDbAssocAction or AcDbAssocDependency needs to be evaluated.